{
    "version": "https://jsonfeed.org/version/1",
    "title": "Marvellous Codeworks",
    "description": "",
    "home_page_url": "https://www.marvellouscode.works",
    "feed_url": "https://www.marvellouscode.works/feed.json",
    "user_comment": "",
    "author": {
        "name": "MCW Team"
    },
    "items": [
        {
            "id": "https://www.marvellouscode.works/the-marvellous-suspender-hello-world/",
            "url": "https://www.marvellouscode.works/the-marvellous-suspender-hello-world/",
            "title": " The Marvellous Suspender: Hello World! ",
            "summary": "I didn’t think I would ever write such an article, yet here we are. I want to tell you very quickly who I am, what I do and what is happening to The Marvellous Suspender, an extension for Google Chrome that has suddenly come under&hellip;",
            "content_html": "<p>I didn’t think I would ever write such an article, yet here we are. I want to tell you very quickly who I am, what I do and what is happening to <strong>The Marvellous Suspender</strong>, an extension for Google Chrome that has suddenly come under the spotlight since Google decided to block and “<em>withdraw from the market</em>” the original The Great Suspender. This article is published in Italian and also localized in English to allow all new friends who have landed here to better understand the evolution of history.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://www.marvellouscode.works/media/posts/1/the-marvellous-suspender-cosa-sta-succedendo-scaled.jpg\" alt=\"\" width=\"2560\" height=\"1781\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://www.marvellouscode.works/media/posts/1/responsive/the-marvellous-suspender-cosa-sta-succedendo-scaled-xs.webp 640w ,https://www.marvellouscode.works/media/posts/1/responsive/the-marvellous-suspender-cosa-sta-succedendo-scaled-sm.webp 768w ,https://www.marvellouscode.works/media/posts/1/responsive/the-marvellous-suspender-cosa-sta-succedendo-scaled-md.webp 1024w ,https://www.marvellouscode.works/media/posts/1/responsive/the-marvellous-suspender-cosa-sta-succedendo-scaled-lg.webp 1366w ,https://www.marvellouscode.works/media/posts/1/responsive/the-marvellous-suspender-cosa-sta-succedendo-scaled-xl.webp 1600w ,https://www.marvellouscode.works/media/posts/1/responsive/the-marvellous-suspender-cosa-sta-succedendo-scaled-2xl.webp 1920w\"><figcaption><a class=\"stockpack-author\" href=\"https://unsplash.com/@wilhelmgunkel?utm_source=Stockpack&amp;utm_medium=referral&amp;utm_campaign=api-credit\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Wilhelm Gunkel</a></figcaption></figure>\n<h1>Who?</h1>\n<p>Giovanni, 35 years old, Italian, System Administrator by trade, curious about the world of development (experimenter in the very little spare time available), all-round passionate about technology, lover of the Open Source world, always engaged with Mozilla Italy in localization and product promotion, I have travelled around the world and met many beautiful people as passionate as I am.</p>\n<h1>Why?</h1>\n<p>For work, I also use Google Chrome and I found The Great Suspender indispensable to prevent the RAM consumption of my work machine from becoming exaggerated. I created The Marvellous Suspender when I started reading about the unwelcome novelty issue in the TGS source code (<a href=\"https://github.com/greatsuspender/thegreatsuspender/issues/1263\" rel=\"noopener\">github.com/greatsuspender/thegreatsuspender/issues/1263</a>). So I took all the good of the original extension (stop on GitHub at version 7.1.6) and I decided to cut out any reference to the statistics and possible malware integrated into the latest version of TGS. Having a Google developer account available, I also wanted to upload The Marvellous Suspender to the Chrome Store.</p>\n<p>I did it mainly for myself and some of my friends and acquaintances. I didn’t think The Marvellous Suspender could get so much attention. What happened is something I never expected:</p>\n<p><a href=\"https://x.com/Gioxx/status/1357463617260691458\">https://x.com/Gioxx/status/1357463617260691458</a></p>\n<p>From that moment, I’ve lost count of how many emails, private messages and much more arrived at the doors of my accounts on Social Networks and beyond. I can only thank you all and feel honoured for this undeserved attention.</p>\n<h1>Future</h1>\n<p>Thanks to the help of all of you, The Marvellous Suspender can become what The Great Suspender has ceased to be: a fantastic add-on for Google Chrome and maybe even Firefox soon. I can’t be the main developer of the add-on because, even though I know my way around this world, I can’t bring the skill and ability of a real developer who can improve the original project. But I can make you a promise: I will take care of this add-on over time and make sure that what happened to The Great Suspender doesn’t happen again.</p>\n<p>I have already contacted some of my family and developer friends who will help me analyze problems and suggestions trying to do a great job on The Marvellous Suspender. The works will begin in the next few days and we will dedicate part of our time to the project to make it evolve.</p>\n<p>I have no desire or intention to sell The Marvellous Suspender, neither today nor ever. The project is Open Source, so it must remain, I don’t care about statistics and I don’t want to keep and sell anyone’s data. I am the first user of The Marvellous Suspender and I want this extension to remain clean, performing, easy to use, suitable for all of us.</p>\n<p>Anyone can help out if they have the ability: the source code is <a href=\"https://github.com/gioxx/MarvellousSuspender\" rel=\"noopener\">the one available on GitHub</a> (the same that I then bring in the ZIP file that I upload to the Chrome Store) and the localization is taken care of through the <a href=\"https://crowdin.com/project/tms\" rel=\"noopener\">use of Crowdin</a>.</p>\n<p><strong>#StaySafe</strong></p>",
            "image": "https://www.marvellouscode.works/media/posts/1/the-marvellous-suspender-per-google-chrome-4-scaled.webp",
            "author": {
                "name": "Giovanni"
            },
            "tags": [
            ],
            "date_published": "2021-02-06T09:30:00+01:00",
            "date_modified": "2025-10-15T23:00:57+02:00"
        }
    ]
}
